In [15]:
import pandas as pd
# 创建一维数组 Series 带标签的数组 索引
t= pd.Series([1,2,3,4,5,6,7,8,9])

type(t)

pandas.core.series.Series

In [3]:
t

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [4]:
# 指定索引
t2 = pd.Series([1,2,3,4,5],index=list("abcde"))
t2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
# 传入字典 则对应键为索引
temp_dict = {"name":"hahaha", "age":26, "city":"beijing"}
t3 = pd.Series(temp_dict)
t3

name     hahaha
age          26
city    beijing
dtype: object

In [13]:
# 使用方法和字典类似 可以通过索引取数，也可以通过位置取数
# 注意取不到值会报错 报错 报错
print(t3["age"])
print(t3[1])
print(t3[:2])
print(t3[["age","city"]])

26
26
name    hahaha
age         26
dtype: object
age          26
city    beijing
dtype: object

In [18]:
pd.DataFrame(np.arange(12).reshape(3, 4))

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [27]:
df = pd.DataFrame(np.arange(12).reshape(3, 4),index=list("abc"),columns=list("WXYZ"))

In [28]:
df.shape[0]

3

In [30]:
df.head(2) # 显示前几行

   W  X  Y  Z
a  0  1  2  3
b  4  5  6  7

In [31]:
df.tail(2)  # 显示后几行

   W  X   Y   Z
b  4  5   6   7
c  8  9  10  11

In [32]:
df.info() # 显示概览

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       3 non-null      int32
 1   X       3 non-null      int32
 2   Y       3 non-null      int32
 3   Z       3 non-null      int32
dtypes: int32(4)
memory usage: 72.0+ bytes

In [33]:
df.describe() # 数据快速统计概览

         W    X     Y     Z
count  3.0  3.0   3.0   3.0
mean   4.0  5.0   6.0   7.0
std    4.0  4.0   4.0   4.0
min    0.0  1.0   2.0   3.0
25%    2.0  3.0   4.0   5.0
50%    4.0  5.0   6.0   7.0
75%    6.0  7.0   8.0   9.0
max    8.0  9.0  10.0  11.0

In [37]:
df.index  # 行索引

Index(['a', 'b', 'c'], dtype='object')

In [38]:
df.columns  # 列索引

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [39]:
df.values  # 对象值

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [40]:
df.ndim # 数据维度

2

In [41]:
df2 = pd.read_csv("D:\dataset\largest_internet_company.csv")
df2.head()

,Rank,Company,Revenue ($B),F.Y.,Employees,Market cap. ($B),Headquarters,Founded,Industry
0,1,Amazon,386.06,2020,1298000.0,1668.00,Seattle,1994,Ecommerce
1,2,Alphabet,182.53,2020,135301.0,1524.00,Mountain View,1998,Internet
2,3,JD.com,114.97,2020,310000.0,115.96,Beijing,1998,Ecommerce
3,4,Meta,85.96,2020,58604.0,842.49,Menlo Park,2004,Social Media
4,5,Tencent,74.31,2020,85858.0,763.11,Shenzhen,1998,Internet

In [43]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Rank              101 non-null    int64
 1   Company           101 non-null    object
 2   Revenue ($B)      101 non-null    float64
 3   F.Y.              101 non-null    int64
 4   Employees         94 non-null     float64
 5   Market cap. ($B)  78 non-null     float64
 6   Headquarters      101 non-null    object
 7   Founded           101 non-null    int64
 8   Industry          101 non-null    object
dtypes: float64(3), int64(3), object(3)
memory usage: 7.2+ KB

In [44]:
df3 = pd.read_csv("D:\dataset\data.csv")
df3.head()

,Agency,Platform,Url,Date_Sampled,Likes_Followers_Visits_Downloads
0,OEM,SMS,NaN,2012-02-17,61652.0
1,OEM,SMS,NaN,2012-11-09,44547.0
2,EDC,Flickr,http://www.flickr.com/nycedc,2012-05-09,NaN
3,NYCHA,Newsletter,NaN,2012-05-09,NaN
4,DHS,Twitter,www.twitter.com/nycdhs,2012-06-13,389.0

In [45]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5898 entries, 0 to 5897
Data columns (total 5 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Agency                            5878 non-null   object
 1   Platform                          5898 non-null   object
 2   Url                               5738 non-null   object
 3   Date_Sampled                      5898 non-null   object
 4   Likes_Followers_Visits_Downloads  3978 non-null   float64
dtypes: float64(1), object(4)
memory usage: 230.5+ KB

In [53]:
df3.sort_values("Likes_Followers_Visits_Downloads", ascending=False)[:10]  # 降序排序
# 注意用数字表示取对应行，用标签表示取对应列

     Agency Platform    Url Date_Sampled  Likes_Followers_Visits_Downloads
5606  TOTAL    TOTAL  TOTAL   2012-11-02                         2746218.0
5314  TOTAL    TOTAL  TOTAL   2012-10-24                         2605149.0
5021  TOTAL    TOTAL  TOTAL   2012-09-21                         2526367.0
4725  TOTAL    TOTAL  TOTAL   2012-08-02                         2383470.0
4430  TOTAL    TOTAL  TOTAL   2012-07-05                         2324933.0
4140  TOTAL    TOTAL  TOTAL   2012-06-13                         2262887.0
3550  TOTAL    TOTAL  TOTAL   2012-04-30                         1853118.0
3846  TOTAL    TOTAL  TOTAL   2012-05-09                         1835426.0
3255  TOTAL    TOTAL  TOTAL   2012-04-09                         1752711.0
2956  TOTAL    TOTAL  TOTAL   2012-03-14                         1688764.0

In [59]:
df3[:10]["Likes_Followers_Visits_Downloads"]

0    61652.0
1    44547.0
2        NaN
3        NaN
4      389.0
5      431.0
6     5026.0
7        NaN
8      313.0
9        NaN
Name: Likes_Followers_Visits_Downloads, dtype: float64

In [73]:
# loc通过标签索引获取数据 df.loc(行标签,列标签)

df3.loc[30:35,["Likes_Followers_Visits_Downloads","Platform"]]

    Likes_Followers_Visits_Downloads  Platform
30                             238.0  Facebook
31                             287.0  Facebook
32                             257.0  Facebook
33                             282.0  Facebook
34                             272.0  Facebook
35                             277.0  Facebook

In [75]:
# iloc 通过位置定位
df3.iloc[25:30,:]

,Agency,Platform,Url,Date_Sampled,Likes_Followers_Visits_Downloads
25,DFTA,Facebook,http://www.facebook.com/timebanksnyc,2011-08-08,227.0
26,DOB: Cool Roofs,Facebook,http://www.facebook.com/coolroofs?sk=wall,2011-08-08,194.0
27,NYC & Co,Facebook,http://www.facebook.com/nycgo.nl,2011-08-08,243.0
28,MOIA,Facebook,http://www.facebook.com/pages/NYC-Mayors-Offic...,2011-08-08,237.0
29,CAU,Facebook,http://www.facebook.com/NYCMayorsCAU,2011-08-08,234.0

In [82]:
print(df3[(df3["Likes_Followers_Visits_Downloads"] > 200) & (df3["Likes_Followers_Visits_Downloads"] < 400)])

        Agency  Platform                                                Url  \
4          DHS   Twitter                             www.twitter.com/nycdhs
8         MOME   Android                                     MiNY Venor app
25        DFTA  Facebook               http://www.facebook.com/timebanksnyc
27    NYC & Co  Facebook                   http://www.facebook.com/nycgo.nl
28        MOIA  Facebook  http://www.facebook.com/pages/NYC-Mayors-Offic...
...        ...       ...                                                ...
5846      Prob   Twitter                       www.twitter.com/nycprobation
5877      MOME   YouTube                  http://www.youtube.com/nycmedia25
5878       DPR   YouTube     http://www.youtube.com/user/NYCParksDepartment
5879       DOT   YouTube                      http://www.youtube.com/NYCDOT
5887       DOH   Youtube          http://www.youtube.com/user/drinkingsugar

     Date_Sampled  Likes_Followers_Visits_Downloads
4      2012-06-13                             389.0
8      2011-08-08                             313.0
25     2011-08-08                             227.0
27     2011-08-08                             243.0
28     2011-08-08                             237.0
...           ...                               ...
5846   2012-11-09                             340.0
5877   2012-11-09                             256.0
5878   2012-11-09                             311.0
5879   2012-11-09                             381.0
5887   2012-11-09                             245.0

[657 rows x 5 columns]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5898 entries, 0 to 5897
Data columns (total 5 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Agency                            5878 non-null   object
 1   Platform                          5898 non-null   object
 2   Url                               5738 non-null   object
 3   Date_Sampled                      5898 non-null   object
 4   Likes_Followers_Visits_Downloads  3978 non-null   float64
dtypes: float64(1), object(4)
memory usage: 230.5+ KB

In [91]:
df3[pd.notnull(df3["Likes_Followers_Visits_Downloads"])][:5]  # 去掉Likes_Followers_Visits_Downloads中空行

,Agency,Platform,Url,Date_Sampled,Likes_Followers_Visits_Downloads
0,OEM,SMS,NaN,2012-02-17,61652.0
1,OEM,SMS,NaN,2012-11-09,44547.0
4,DHS,Twitter,www.twitter.com/nycdhs,2012-06-13,389.0
5,DHS,Twitter,www.twitter.com/nycdhs,2012-08-02,431.0
6,DOH,Android,Condom Finder,2011-08-08,5026.0

In [98]:
df3.fillna(df3.mean())[:5]  # 将空值填充为均值
df3["Likes_Followers_Visits_Downloads"] = df3["Likes_Followers_Visits_Downloads"].fillna(df3["Likes_Followers_Visits_Downloads"].mean())[:5]
df3[:5]

# 注意0的情况 0会参加均值计算 如果不想让0运算，可以把0转换为NaN，即t[t==0] = np.nan

,Agency,Platform,Url,Date_Sampled,Likes_Followers_Visits_Downloads
0,OEM,SMS,NaN,2012-02-17,61652.000000
1,OEM,SMS,NaN,2012-11-09,44547.000000
2,EDC,Flickr,http://www.flickr.com/nycedc,2012-05-09,17790.059326
3,NYCHA,Newsletter,NaN,2012-05-09,17790.059326
4,DHS,Twitter,www.twitter.com/nycdhs,2012-06-13,389.000000

In [100]:
df4 = pd.read_csv("D:\dataset\datasets_IMDB-Movie-Data.csv")
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB